docs/init.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2022-07-07 Thu 17:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs Configuration</title>
<meta name="author" content="Thomas Freeman" />
<meta name="description" content="This org-mode file contains an org-babel implementation of the .emacs or .emacs.d/init.el file." />
<meta name="keywords" content="Emacs" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://fniessen.github.io/org-html-themes/src/readtheorg_theme/css/readtheorg.css"/>
</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="index.html"> UP </a>
 |
 <a accesskey="H" href="index.html"> HOME </a>
</div><div id="content" class="content">
<h1 class="title">Emacs Configuration</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org703e699">About this Document</a>
<ul>
<li><a href="#org6c423d7">Tags</a></li>
</ul>
</li>
<li><a href="#org1d07173">Header for <code>init.el</code></a></li>
<li><a href="#orgda135a5">Performance Optimization Start</a></li>
<li><a href="#org450a53d">Load Path</a></li>
<li><a href="#orgbf0d505">Running Emacs as a Portable App</a>
<ul>
<li><a href="#org786d757">Check for Portable Emacs Instance</a></li>
<li><a href="#org0e21e0c">Set Location of Portable Git&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span></span></a></li>
</ul>
</li>
<li><a href="#org339e3a1">Custom Set Variables</a></li>
<li><a href="#org470e827">Package Management</a>
<ul>
<li><a href="#org6d45216">Straight.el</a></li>
<li><a href="#org09bd9c0">Install use-package</a></li>
</ul>
</li>
<li><a href="#orga364025">Startup Tools</a>
<ul>
<li><a href="#orge577850">No-littering</a></li>
<li><a href="#orgdc5fab4">Whicher</a></li>
</ul>
</li>
<li><a href="#orge769a81">Defaults</a></li>
<li><a href="#org0ec016c">Coding</a></li>
<li><a href="#orgefa8308">Completion</a></li>
<li><a href="#org517695d">Docker</a></li>
<li><a href="#orgaf64369">Editing Tools</a></li>
<li><a href="#org83153a2">Elfeed</a></li>
<li><a href="#org9569829">Email</a></li>
<li><a href="#org7fc19ac">EXWM</a></li>
<li><a href="#orga1b6029">File Management</a>
<ul>
<li><a href="#org5708507">Dired</a></li>
<li><a href="#orgdbce0ee">Sunrise Commander</a></li>
</ul>
</li>
<li><a href="#org11b3671">Graphing</a></li>
<li><a href="#org925b12a">Math and Finance</a>
<ul>
<li><a href="#org9bcb97b">Ledger</a></li>
</ul>
</li>
<li><a href="#org83badd9">Org</a></li>
<li><a href="#org68b82a7">Session</a></li>
<li><a href="#org9d949eb">Shells and Terminals</a>
<ul>
<li><a href="#orgc094b4c">Eshell</a></li>
<li><a href="#orgbf0e184">PowerShell&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Windows">Windows</span></span></a></li>
<li><a href="#org581f2c4">VTerm</a></li>
</ul>
</li>
<li><a href="#org518efd6">Theme</a></li>
<li><a href="#org2c7d370">Writing/Publishing/Reading</a>
<ul>
<li><a href="#orga4f3ec1">Academic Writing</a></li>
<li><a href="#org8a6e81d">Spellchecking</a></li>
<li><a href="#org09d5da9">\LaTeX{}</a></li>
<li><a href="#org560e0e8">Markdown</a></li>
<li><a href="#org4fbf7d1">Ox-publish</a></li>
<li><a href="#org1e5ae62">PDF</a></li>
</ul>
</li>
<li><a href="#org22d3fd7">Help</a></li>
<li><a href="#org703ab14">Emacs Server</a></li>
<li><a href="#org343d0f0">Custom Functions</a>
<ul>
<li><a href="#org67ae1a8">Sudo Find File</a></li>
</ul>
</li>
<li><a href="#org836913e">Update Org Files on Portable App Startup</a></li>
<li><a href="#org78610db">Performance Optimization End</a></li>
<li><a href="#orgd68a048">End</a></li>
</ul>
</div>
</div>
<hr />
<p>
Welcome to my Emacs configuration! This file contains the code along with documentation for customizing my Emacs with all the options that I prefer to use by default.
</p>

<div id="outline-container-org703e699" class="outline-2">
<h2 id="org703e699">About this Document</h2>
<div class="outline-text-2" id="text-org703e699">
<p>
This file was written using Emacs Org Mode. This makes navigating and modifying my Emacs configuration much simpler as I can place different elements of my configuration under separate headings. The code in this file is placed in source code blocks that are tangled to the <code>init.el</code> file that Emacs will look for upon starting. When this file is saved, the source code blocks that are marked for tangling will write their contents to <code>init.el</code>.
</p>
</div>

<div id="outline-container-org6c423d7" class="outline-3">
<h3 id="org6c423d7">Tags</h3>
<div class="outline-text-3" id="text-org6c423d7">
<p>
Tags are used in this document to help make navigation of the packages easier and to provide additional information about piecing together this Emacs configuration. Below are descriptions of the tags and their meanings:
</p>

<dl class="org-dl">
<dt>deprecated</dt><dd>This package has been "deprecated" in favor of another package that better integrates with this Emacs configuration or produces a better workflow.</dd>
<dt>disabled</dt><dd>Any package marked with this tag has been disabled due to it causing issues or the package was deprecated.</dd>
<dt>guix</dt><dd>Packages managed by GUIX are marked with this tag. There are a number of reasons why a package might be managed by GUIX over using package managers in Emacs:

<ol class="org-ol">
<li>The package requires compilation on the host system (e.g. Pdf Tools and Org-roam). Using the GUIX package manager will manage the compilation automatically. Also, packages that need to be compiled are difficult to run on portable Emacs so they will be left out when Emacs is used as a portable app.</li>
<li>The package is only run on a Linux System with GUIX installed or on the GUIX System Distribution so there is no need to have Emacs manage this package.</li>
<li>The package relies on another program installed on the host system (e.g. Mu4e requires Mu).</li>
</ol></dd>

<dt>testing</dt><dd>A package or function that is added and is being tested for use is marked with this tag.</dd>
<dt>Windows </dt><dd>Customizations exclusively for the use on the Windows operating system are marked with this tag.</dd>
</dl>
</div>
</div>
</div>

<div id="outline-container-org1d07173" class="outline-2">
<h2 id="org1d07173">Header for <code>init.el</code></h2>
<div class="outline-text-2" id="text-org1d07173">
<p>
The following code block will add a header to the <code>init.el</code> file when it is generated on saving:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;;; </span><span style="color: #546A90;">init.el --- Emacs initialization file -*- lexical-binding: t -*-</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">Copyright (C) 2022 Thomas Freeman</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">Author: Thomas Freeman</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">Maintainer: Thomas Freeman</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">Keywords: lisp</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">Version: 0.0.1</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">Created: 09 Jan 2022</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">This program is free software; you can redistribute it and/or modify</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">it under the terms of the GNU General Public License as published by</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">the Free Software Foundation, either version 3 of the License, or</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">(at your option) any later version.</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">This program is distributed in the hope that it will be useful,</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">but WITHOUT ANY WARRANTY; without even the implied warranty of</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">GNU General Public License for more details.</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">You should have received a copy of the GNU General Public License</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">along with this program.  If not, see <a href="http://www.gnu.org/licenses/">&lt;http://www.gnu.org/licenses/&gt;</a>.</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">Commentary:</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">This file is an init file for Emacs.</span>
<span style="color: #546A90;">;;</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">This file is NOT a part of Emacs.</span>
<span style="color: #546A90;">;;</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">This file IS NOT intended to be edited! It was generated by init.org.</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">URL: https://github.com/tfree87/.emacs.d</span>

<span style="color: #546A90;">;; </span><span style="color: #546A90;">For documentation and for editing this file, see the init.org in the</span>
<span style="color: #546A90;">;; </span><span style="color: #546A90;">github repository tfree87/.emacs.d</span>
<span style="color: #546A90;">;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">Code:</span>
</pre>
</div>
</div>
</div>
