docs/init.html

<div id="outline-container-orgda135a5" class="outline-2">
<h2 id="orgda135a5">Performance Optimization Start</h2>
<div class="outline-text-2" id="text-orgda135a5">
<p>
In order to slightly reduce the load time for Emacs, the whole <code>init.el</code> file can be wrapped in the following let statement to speed up the load process. This can help a little when Emacs is run as a portable app from a flash drive as I often do.See <a href="https://www.reddit.com/r/emacs/comments/3kqt6e/2_easy_little_known_steps_to_speed_up_emacs_start/">this Reddit post</a> for more information.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">let</span> <span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span>file-name-handler-alist nil<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org450a53d" class="outline-2">
<h2 id="org450a53d">Load Path</h2>
<div class="outline-text-2" id="text-org450a53d">
<p>
Since all of the Emacs configuration is in modules, the <code>modules</code> directory and all of its sub-directories must be added to the Emacs <code>load-path</code>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Add modules to Emacs load path</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">let</span> <span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span>default-directory <span style="color: #7984D1;">"~/.emacs.d/modules/"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>normal-top-level-add-subdirs-to-load-path<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf0d505" class="outline-2">
<h2 id="orgbf0d505">Running Emacs as a Portable App</h2>
<div class="outline-text-2" id="text-orgbf0d505">
<p>
I like to use Emacs at work and at home to boost my productivity, but I often find when I am at work or using another computer using Windows and I cannot always install Emacs to the host system. In this case, I run Emacs from a USB thumb drive so that I can still have access to the power of Emacs even when I am not working on my home personal computer. Running Emacs from a thumb drive has some caveats. For instance, if you are running Emacs from a thumb drive on a work computer and you do not have administrator access, then a lot of features will break. This section contains code that can be used to run Emacs.
</p>
</div>

<div id="outline-container-org786d757" class="outline-3">
<h3 id="org786d757">Check for Portable Emacs Instance</h3>
<div class="outline-text-3" id="text-org786d757">
<p>
When <a href="runemacs.bat">runemacs.bat</a> is executed, it will set the environment variable <code>EMACS_PORTABLE</code> to "Y". By checking for this, we can tell that Emacs that it was executed to be run from a flash drive.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff;">freemacs/isportable-p</span> <span style="color: #ff2afc;">()</span>
  <span style="color: #A875FF;">"A function to check whether Emacs was executed as a portable application in Windows by the runemacs.bat script."</span>
  <span style="color: #ff2afc;">(</span>string= <span style="color: #a7da1e;">(</span>getenv <span style="color: #7984D1;">"EMACS_PORTABLE"</span><span style="color: #a7da1e;">)</span> <span style="color: #7984D1;">"Y"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0e21e0c" class="outline-3">
<h3 id="org0e21e0c">Set Location of Portable Git&#xa0;&#xa0;&#xa0;<span class="tag"><span class="git">git</span></span></h3>
<div class="outline-text-3" id="text-org0e21e0c">
<p>
Straight.el cannot operate without access to Git. Luckily, there is a portable version of Git (<a href="https://github.com/sheabunge/GitPortable">sheabunge/GitPortable</a>) for Windows that can be installed on the <a href="https://portableapps.com/">PortableApp</a> platform to provide access to Git without having it installed on the host system. After downloading GitPortable, we need to tell Emacs where it can find the binary executable so that Emacs programs can call Git when needed.
</p>

<p>
The following line code will check to see if Emacs is being run as a portable app and, if it is, then add the path where git.exe can be found to the <code>exec-path</code> list:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #ff2afc;">(</span>freemacs/isportable-p<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>add-to-list 'exec-path <span style="color: #7984D1;">"~/PortableApps/GitPortable/App/Git/bin"</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org339e3a1" class="outline-2">
<h2 id="org339e3a1">Custom Set Variables</h2>
<div class="outline-text-2" id="text-org339e3a1">
<p>
In order to keep variables set by the customize interface or set during Emacs at runtime from being placed at the top of <code>init.el</code>, I set the variables set from Emacs customize to be put into a separate file <a href="./custom.el">./custom.el</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #546A90;">;; </span><span style="color: #546A90;">Set the location of variables set using Emacs customize interface</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> custom-file <span style="color: #7984D1;">"~/.emacs.d/custom.el"</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
Once the file location has been set, Emacs needs to load the custom file. This needs to be done early in the loading process because it contains the addresses for the package repositories. If this is not loaded before refreshing packages and making calls to <code>use-package</code>, then the <code>:ensure</code> command will not be able to pull the packages and install them.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the file custom.el file containing variables from Emacs customize</span>

<span style="color: #1ea8fc;">(</span>load custom-file<span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org470e827" class="outline-2">
<h2 id="org470e827">Package Management</h2>
<div class="outline-text-2" id="text-org470e827">
<p>
In this section, I have included customization to replace the default Emacs package manager with <a href="https://github.com/raxod502/straight.el">straight.el</a>. Some reasons for making this switch are:
</p>

<ol class="org-ol">
<li>It is easier to avoid conflicts with different package repositories such as duplicates packages in ELPA and MELPA.</li>
<li>I can define a specific fork to use for a specific package to get bug fixes or modifications.</li>
<li>The entire package repository is cloned, which, while it takes up a lot of space, allows for editing the source code directly if desired.</li>
<li>Github repositories that are not included in ELPA, MELPA, or marmalade can be pulled 
used in <code>use-package</code> statements.</li>
</ol>
</div>

<div id="outline-container-org6d45216" class="outline-3">
<h3 id="org6d45216">Straight.el</h3>
<div class="outline-text-3" id="text-org6d45216">
<p>
Instead of using the built-in package manager, use <a href="https://github.com/raxod502/straight.el">straight.el</a> to pull all the packages straight from their repositories.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp">
<span style="color: #546A90;">;; </span><span style="color: #546A90;">Install Straight.el to manage packages</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">defvar</span> <span style="color: #df85ff;">bootstrap-version</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">let</span> <span style="color: #ff2afc;">(</span><span style="color: #a7da1e;">(</span>bootstrap-file
       <span style="color: #df85ff;">(</span>expand-file-name
        <span style="color: #7984D1;">"straight/repos/straight.el/bootstrap.el"</span>
        user-emacs-directory<span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span>
      <span style="color: #a7da1e;">(</span>bootstrap-version 5<span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">unless</span> <span style="color: #a7da1e;">(</span>file-exists-p bootstrap-file<span style="color: #a7da1e;">)</span>
    <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">with-current-buffer</span>
        <span style="color: #df85ff;">(</span>url-retrieve-synchronously
         <span style="color: #7984D1;">"https://raw.githubusercontent.com/raxod502/straight.el/develop/install.el"</span>
         'silent 'inhibit-cookies<span style="color: #df85ff;">)</span>
      <span style="color: #df85ff;">(</span>goto-char <span style="color: #A875FF;">(</span>point-max<span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span>
      <span style="color: #df85ff;">(</span>eval-print-last-sexp<span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>load bootstrap-file nil 'nomessage<span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
