init.org
** Install use-package

Use ~straight.el~ to install ~use-package~ to manage Emacs packages.

#+begin_src emacs-lisp :tangle yes
  ;; Set up use-package to manage package loading

  (straight-use-package 'use-package)
#+end_src

Straight can be configured as the default manager for ~use-package~ using the following option:

#+begin_src emacs-lisp :tangle no
  (setq straight-use-package-by-default t)
#+end_src

However, as I have started using the GUIX System Distribution I have found that it can be beneficial to pick and choose which packages are managed by straight and which are managed by GUIX . Packages that I want to use across Linux and Windows operating systems can be managed by straight, and those that I only use on GUIX or require compiling on the host system (such as EXWM and pdf-tools) can be managed by GUIX.

* Startup Tools

This section contains many of the tools used at Emacs startup that are helpful when other packages are initialized.

** No-littering

The [[https://github.com/emacscollective/no-littering][no-littering]] package will put Emacs configuration files for many third-party packages into separate folders under ~.emacs.d/etc/~ to help keep the ~.emacs.d/~ from getting to cluttered with different configuration files. This needs to be run before the other packages are initialized in order to ensure that when the pacakges are loaded that their configuration files will be put into the correct location.

#+begin_src emacs-lisp :tangle yes
  ;; Load No-littering module

  (require 'freemacs-no-littering)
#+end_src

** Whicher

[[https://github.com/abo-abo/whicher][Whicher]] provides a quick tool to check for missing executable dependencies without much cost to Emacs startup time. This needs to be loaded before the rest of init.el so that as init.el is loaded, it can look for missing executables on the host system.

#+begin_src emacs-lisp :tangle yes
  ;; Load Whicher module

  (require 'freemacs-whicher)
#+end_src

* Defaults

Emacs has many default options that can be changed to make Emacs more productive in a modern computing environment. Changes to the default settings of Emacs can be found in the [[file:modules/defaults/freemacs-defaults.org][defaults module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load Defaults module

  (require 'freemacs-defaults)
#+end_src

* Coding

Modifications to the coding modes for Emacs are defined in the [[file:modules/coding/freemacs-coding.org][coding module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load the coding module

  (require 'freemacs-coding)
#+end_src

* Completion

While Emacs has built-in completion systems, the combination of the following tools makes Emacs completion very powerful:

+ Vertico
+ Orderless
+ Cape
+ Consult
+ Marginalia
+ Embark

The configuration of these elements can be found in the [[file:modules/completion/freemacs-completion.org][completion module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load the completion module

  (require 'freemacs-completion)
#+end_src

* Docker

Tools for working with Docker and Docker files are included in the [[file:modules/docker/freemacs-docker.org][docker module]]. It configures the following packages:

+ Docker :: Manage Docker containers from within Emacs
+ Docker Compose  :: Edit docker-compose files in Emacs

#+begin_src emacs-lisp :tangle yes
  ;; Load the Docker module

  (require 'freemacs-docker)
#+end_src

* Editing Tools

General editing tools are configured in the Emacs [[file:modules/editing/freemacs-editing.org][editing module]]. This includes:

+ Multiple Cursors :: Edit text in multiple locations in the buffer simulaneously
+ YASnippet :: Insert small predefined templates into Emacs

#+begin_src emacs-lisp :tangle yes
  ;; Load the editing module

  (require 'freemacs-editing)
#+end_src

* Elfeed

Elfeed is a news and RSS reader for Emacs. The configuration for Elfeed can be found in the [[file:modules/elfeed/freemacs-elfeed.org][Elfeed module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load Elfeed newsreader module

  (require 'freemacs-elfeed)
#+end_src

* Email

Email is managed using the Mu4e package that uses the Mu backend to search through emails that are stored using the Maildir format. The configuration can be found at [[file:modules/email/freemacs-email.org][email module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load email module

  (require 'freemacs-email)
#+end_src

* EXWM

EXWM is a window manager that runs entirely wihtin Emacs. With EXWM, Emacs frames and windows can be used to manage X11 applications. Each X11 application runs in a separate window and can be accessed as a separate buffer using Emacs commands.

#+begin_src emacs-lisp :tangle yes
  ;; Load the EXWM module

  (require 'freemacs-exwm)
#+end_src

* File Management

This section contains tools for working with the file system from within Emacs.

