docs/init.html

<div id="outline-container-org09bd9c0" class="outline-3">
<h3 id="org09bd9c0">Install use-package</h3>
<div class="outline-text-3" id="text-org09bd9c0">
<p>
Use <code>straight.el</code> to install <code>use-package</code> to manage Emacs packages.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Set up use-package to manage package loading</span>

<span style="color: #1ea8fc;">(</span>straight-use-package 'use-package<span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
Straight can be configured as the default manager for <code>use-package</code> using the following option:
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> straight-use-package-by-default t<span style="color: #1ea8fc;">)</span>
</pre>
</div>

<p>
However, as I have started using the GUIX System Distribution I have found that it can be beneficial to pick and choose which packages are managed by straight and which are managed by GUIX . Packages that I want to use across Linux and Windows operating systems can be managed by straight, and those that I only use on GUIX or require compiling on the host system (such as EXWM and pdf-tools) can be managed by GUIX.
</p>
</div>
</div>
</div>

<div id="outline-container-orga364025" class="outline-2">
<h2 id="orga364025">Startup Tools</h2>
<div class="outline-text-2" id="text-orga364025">
<p>
This section contains many of the tools used at Emacs startup that are helpful when other packages are initialized.
</p>
</div>

<div id="outline-container-orge577850" class="outline-3">
<h3 id="orge577850">No-littering</h3>
<div class="outline-text-3" id="text-orge577850">
<p>
The <a href="https://github.com/emacscollective/no-littering">no-littering</a> package will put Emacs configuration files for many third-party packages into separate folders under <code>.emacs.d/etc/</code> to help keep the <code>.emacs.d/</code> from getting to cluttered with different configuration files. This needs to be run before the other packages are initialized in order to ensure that when the pacakges are loaded that their configuration files will be put into the correct location.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load No-littering module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-no-littering</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdc5fab4" class="outline-3">
<h3 id="orgdc5fab4">Whicher</h3>
<div class="outline-text-3" id="text-orgdc5fab4">
<p>
<a href="https://github.com/abo-abo/whicher">Whicher</a> provides a quick tool to check for missing executable dependencies without much cost to Emacs startup time. This needs to be loaded before the rest of init.el so that as init.el is loaded, it can look for missing executables on the host system.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load Whicher module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-whicher</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orge769a81" class="outline-2">
<h2 id="orge769a81">Defaults</h2>
<div class="outline-text-2" id="text-orge769a81">
<p>
Emacs has many default options that can be changed to make Emacs more productive in a modern computing environment. Changes to the default settings of Emacs can be found in the <a href="modules/defaults/freemacs-defaults.html">defaults module</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load Defaults module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-defaults</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0ec016c" class="outline-2">
<h2 id="org0ec016c">Coding</h2>
<div class="outline-text-2" id="text-org0ec016c">
<p>
Modifications to the coding modes for Emacs are defined in the <a href="modules/coding/freemacs-coding.html">coding module</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the coding module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-coding</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgefa8308" class="outline-2">
<h2 id="orgefa8308">Completion</h2>
<div class="outline-text-2" id="text-orgefa8308">
<p>
While Emacs has built-in completion systems, the combination of the following tools makes Emacs completion very powerful:
</p>

<ul class="org-ul">
<li>Vertico</li>
<li>Orderless</li>
<li>Cape</li>
<li>Consult</li>
<li>Marginalia</li>
<li>Embark</li>
</ul>

<p>
The configuration of these elements can be found in the <a href="modules/completion/freemacs-completion.html">completion module</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the completion module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-completion</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org517695d" class="outline-2">
<h2 id="org517695d">Docker</h2>
<div class="outline-text-2" id="text-org517695d">
<p>
Tools for working with Docker and Docker files are included in the <a href="modules/docker/freemacs-docker.html">docker module</a>. It configures the following packages:
</p>

<dl class="org-dl">
<dt>Docker</dt><dd>Manage Docker containers from within Emacs</dd>
<dt>Docker Compose </dt><dd>Edit docker-compose files in Emacs</dd>
</dl>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the Docker module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-docker</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgaf64369" class="outline-2">
<h2 id="orgaf64369">Editing Tools</h2>
<div class="outline-text-2" id="text-orgaf64369">
<p>
General editing tools are configured in the Emacs <a href="modules/editing/freemacs-editing.html">editing module</a>. This includes:
</p>

<dl class="org-dl">
<dt>Multiple Cursors</dt><dd>Edit text in multiple locations in the buffer simulaneously</dd>
<dt>YASnippet</dt><dd>Insert small predefined templates into Emacs</dd>
</dl>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the editing module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-editing</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org83153a2" class="outline-2">
<h2 id="org83153a2">Elfeed</h2>
<div class="outline-text-2" id="text-org83153a2">
<p>
Elfeed is a news and RSS reader for Emacs. The configuration for Elfeed can be found in the <a href="modules/elfeed/freemacs-elfeed.html">Elfeed module</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load Elfeed newsreader module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-elfeed</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9569829" class="outline-2">
<h2 id="org9569829">Email</h2>
<div class="outline-text-2" id="text-org9569829">
<p>
Email is managed using the Mu4e package that uses the Mu backend to search through emails that are stored using the Maildir format. The configuration can be found at <a href="modules/email/freemacs-email.html">email module</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load email module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-email</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org7fc19ac" class="outline-2">
<h2 id="org7fc19ac">EXWM</h2>
<div class="outline-text-2" id="text-org7fc19ac">
<p>
EXWM is a window manager that runs entirely wihtin Emacs. With EXWM, Emacs frames and windows can be used to manage X11 applications. Each X11 application runs in a separate window and can be accessed as a separate buffer using Emacs commands.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the EXWM module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-exwm</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga1b6029" class="outline-2">
<h2 id="orga1b6029">File Management</h2>
<div class="outline-text-2" id="text-orga1b6029">
<p>
This section contains tools for working with the file system from within Emacs.
</p>
</div>
