init.org
** Dired

The [[file:modules/file-tools/freemacs-dired.org][Dired module]] contains changes and improvements to the Dired (directory editor) package in Emacs.

#+begin_src emacs-lisp :tangle yes
  ;; Load file tools module

  (require 'freemacs-dired)
#+end_src

** Sunrise Commander

[[https://github.com/sunrise-commander/sunrise-commander][Sunrise Commander]] is a two-pane orthodox file manager similar to Midnight Commander. The configuration for Sunrise Commander is in the [[file:modules/file-tools/freemacs-sunrise.org][sunrise module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load sunrise module

  (require 'freemacs-sunrise)
#+end_src

* Graphing

Emacs can be used as an environment to create graphs, plots, and diagrams. Configuration for these are found in the [[file:modules/graphing/freemacs-graphing.org][graphing module]].

+ Gnuplot :: Create plots using Gnuplot in Emacs
+ PlantUML :: Create UML diagrams with PlantUML 

#+begin_src emacs-lisp :tangle yes
  ;; Load graphing module

  (require 'freemacs-graphing)
#+end_src

* Math and Finance

** Ledger

Ledger is a plain-text accounting system that is very fast, powerful and safe. The configuration for ledger in Emacs can be found in the [[file:modules/math/freemacs-ledger.org][ledger module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load the Ledger module

  (require 'freemacs-ledger)
#+end_src

* Org

#+begin_src emacs-lisp :tangle yes
  ;; Load the Org Mode module

  (require 'freemacs-org)
#+end_src

* Session

This section contains customizations for controlling how to navigate between Emacs windows, frames, and buffers.

#+begin_src emacs-lisp :tangle yes
  ;; Load session module

  (require 'freemacs-session)
#+end_src

* Shells and Terminals

This section contains configuration options for terminals in Emacs. 

** Eshell

#+begin_src emacs-lisp :tangle yes
  ;; Load the Eshell module

  (require 'freemacs-eshell)
#+end_src

** PowerShell :Windows:

[[https://github.com/jschaf/powershell.el][Powershell.el]] creates a function that will launch an inferior shell that will run the Windows PowerShell tool.

#+begin_src emacs-lisp :tangle yes
  ;; Load PowerShell module

  (require 'freemacs-powershell)
#+end_src

** VTerm

#+begin_src emacs-lisp :tangle yes
  ;; Load the VTerm module

  (require 'freemacs-vterm)
#+end_src

* Theme

Changes to Emacs appearance and theme can be found in the [[file:modules/theme/freemacs-theme.org][theme module]].

#+begin_src emacs-lisp :tangle yes
  ;; Load theme module

  (require 'freemacs-theme)
#+end_src

#+begin_src emacs-lisp :tangle yes
  ;; Load All the Icons module

  (require 'freemacs-alltheicons)
#+end_src

* Writing/Publishing/Reading

This section contains customizations for Emacs to improve the environment for writing papers, publishing paper and websites, and reading documents.

** Academic Writing

The [[file:modules/publishing/freemacs-academic-writing.org][academic writing module]] contains configurations to improve the environment for writing academic papers in Emacs. It contains configuration for the following packages:

+ Academic Phrases :: A package that inserts common template phrases into academic papers
+ Citar :: A citation tool that simplifies adding citations to documents
+ Org Cite :: The built-in Org Mode citation management system

#+begin_src emacs-lisp :tangle yes
  ;; Load Academic Writing module

  (require 'freemacs-academic-writing)
#+end_src

** Spellchecking



#+begin_src emacs-lisp :tangle yes
  ;; Load Spellchecking module

  (require 'freemacs-spellcheck)
#+end_src

** \LaTeX{}



#+begin_src emacs-lisp :tangle yes
  ;; Load the LaTeX module

  (require 'freemacs-latex)
#+end_src

** Markdown

The [[file:modules/publishing/freemacs-markdown.org][markdown module]] adds additional features to improve editing markdown files in Emacs.

#+begin_src emacs-lisp :tangle yes
  ;; Load the markdown module

  (require 'freemacs-markdown)
#+end_src

** Ox-publish



#+begin_src emacs-lisp :tangle yes
  ;; Load the ox-publish module

  (require 'freemacs-ox-publish)
#+end_src

