docs/init.html

<div id="outline-container-org5708507" class="outline-3">
<h3 id="org5708507">Dired</h3>
<div class="outline-text-3" id="text-org5708507">
<p>
The <a href="modules/file-tools/freemacs-dired.html">Dired module</a> contains changes and improvements to the Dired (directory editor) package in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load file tools module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-dired</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgdbce0ee" class="outline-3">
<h3 id="orgdbce0ee">Sunrise Commander</h3>
<div class="outline-text-3" id="text-orgdbce0ee">
<p>
<a href="https://github.com/sunrise-commander/sunrise-commander">Sunrise Commander</a> is a two-pane orthodox file manager similar to Midnight Commander. The configuration for Sunrise Commander is in the <a href="modules/file-tools/freemacs-sunrise.html">sunrise module</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load sunrise module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-sunrise</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org11b3671" class="outline-2">
<h2 id="org11b3671">Graphing</h2>
<div class="outline-text-2" id="text-org11b3671">
<p>
Emacs can be used as an environment to create graphs, plots, and diagrams. Configuration for these are found in the <a href="modules/graphing/freemacs-graphing.html">graphing module</a>.
</p>

<dl class="org-dl">
<dt>Gnuplot</dt><dd>Create plots using Gnuplot in Emacs</dd>
<dt>PlantUML</dt><dd>Create UML diagrams with PlantUML</dd>
</dl>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load graphing module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-graphing</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org925b12a" class="outline-2">
<h2 id="org925b12a">Math and Finance</h2>
<div class="outline-text-2" id="text-org925b12a">
</div>
<div id="outline-container-org9bcb97b" class="outline-3">
<h3 id="org9bcb97b">Ledger</h3>
<div class="outline-text-3" id="text-org9bcb97b">
<p>
Ledger is a plain-text accounting system that is very fast, powerful and safe. The configuration for ledger in Emacs can be found in the <a href="modules/math/freemacs-ledger.html">ledger module</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the Ledger module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-ledger</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org83badd9" class="outline-2">
<h2 id="org83badd9">Org</h2>
<div class="outline-text-2" id="text-org83badd9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the Org Mode module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-org</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org68b82a7" class="outline-2">
<h2 id="org68b82a7">Session</h2>
<div class="outline-text-2" id="text-org68b82a7">
<p>
This section contains customizations for controlling how to navigate between Emacs windows, frames, and buffers.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load session module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-session</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9d949eb" class="outline-2">
<h2 id="org9d949eb">Shells and Terminals</h2>
<div class="outline-text-2" id="text-org9d949eb">
<p>
This section contains configuration options for terminals in Emacs. 
</p>
</div>

<div id="outline-container-orgc094b4c" class="outline-3">
<h3 id="orgc094b4c">Eshell</h3>
<div class="outline-text-3" id="text-orgc094b4c">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the Eshell module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-eshell</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf0e184" class="outline-3">
<h3 id="orgbf0e184">PowerShell&#xa0;&#xa0;&#xa0;<span class="tag"><span class="Windows">Windows</span></span></h3>
<div class="outline-text-3" id="text-orgbf0e184">
<p>
<a href="https://github.com/jschaf/powershell.el">Powershell.el</a> creates a function that will launch an inferior shell that will run the Windows PowerShell tool.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load PowerShell module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-powershell</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org581f2c4" class="outline-3">
<h3 id="org581f2c4">VTerm</h3>
<div class="outline-text-3" id="text-org581f2c4">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the VTerm module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-vterm</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org518efd6" class="outline-2">
<h2 id="org518efd6">Theme</h2>
<div class="outline-text-2" id="text-org518efd6">
<p>
Changes to Emacs appearance and theme can be found in the <a href="modules/theme/freemacs-theme.html">theme module</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load theme module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-theme</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load All the Icons module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-alltheicons</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org2c7d370" class="outline-2">
<h2 id="org2c7d370">Writing/Publishing/Reading</h2>
<div class="outline-text-2" id="text-org2c7d370">
<p>
This section contains customizations for Emacs to improve the environment for writing papers, publishing paper and websites, and reading documents.
</p>
</div>

<div id="outline-container-orga4f3ec1" class="outline-3">
<h3 id="orga4f3ec1">Academic Writing</h3>
<div class="outline-text-3" id="text-orga4f3ec1">
<p>
The <a href="modules/publishing/freemacs-academic-writing.html">academic writing module</a> contains configurations to improve the environment for writing academic papers in Emacs. It contains configuration for the following packages:
</p>

<dl class="org-dl">
<dt>Academic Phrases</dt><dd>A package that inserts common template phrases into academic papers</dd>
<dt>Citar</dt><dd>A citation tool that simplifies adding citations to documents</dd>
<dt>Org Cite</dt><dd>The built-in Org Mode citation management system</dd>
</dl>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load Academic Writing module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-academic-writing</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8a6e81d" class="outline-3">
<h3 id="org8a6e81d">Spellchecking</h3>
<div class="outline-text-3" id="text-org8a6e81d">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load Spellchecking module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-spellcheck</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org09d5da9" class="outline-3">
<h3 id="org09d5da9">\LaTeX{}</h3>
<div class="outline-text-3" id="text-org09d5da9">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the LaTeX module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-latex</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org560e0e8" class="outline-3">
<h3 id="org560e0e8">Markdown</h3>
<div class="outline-text-3" id="text-org560e0e8">
<p>
The <a href="modules/publishing/freemacs-markdown.html">markdown module</a> adds additional features to improve editing markdown files in Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the markdown module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-markdown</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org4fbf7d1" class="outline-3">
<h3 id="org4fbf7d1">Ox-publish</h3>
<div class="outline-text-3" id="text-org4fbf7d1">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the ox-publish module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-ox-publish</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
