init.org
** PDF



#+begin_src emacs-lisp :tangle yes
  ;; Load the pdf module

  (require 'freemacs-pdf)
#+end_src

* Help

The [[file:modules/help/freemacs-help.org][help module]] contains configuration that adds additional tools for help tools in Emacs:

+ Helpful :: Adds extra information to Emacs help buffers
+ Which-key :: Shows a list of key bindings in Emacs for the current major mode

#+begin_src emacs-lisp :tangle yes
  ;; Load the help module

  (require 'freemacs-help)
#+end_src

* Emacs Server

Emacs can be run in a server mode where all other instances of Emacs can connect to it and have access to the same buffers. This also greatly increases the load time of new Emacs instances as Emacs does not have to go through the initialization process again. The configuration of the Emacs server can be found in the [[file:modules/server/freemacs-server.org][server module]].

#+begin_src emacs-lisp :tangle yes :noweb yes
  ;; Load server module

  (require 'freemacs-server)
#+end_src

* Custom Functions

This section contains custom functions that I have either created myself or borrowed from others to accomplish small tasks.

#+begin_src emacs-lisp :tangle yes
;; Custom Function Definitions
#+end_src

** Sudo Find File

This function creates a ~sudo-find-file~ command that can be used to open files as the super user. This can be really useful when combined with Embark. This function was copied from https://karthinks.com/software/fifteen-ways-to-use-embark/.

#+begin_src emacs-lisp :tangle yes
  (whicher "sudo")
  (defun sudo-find-file (file)
    "Open FILE as root."
    (interactive "FOpen file as root: ")
    (when (file-writable-p file)
      (user-error "File is user writeable, aborting sudo"))
    (find-file (if (file-remote-p file)
                   (concat "/" (file-remote-p file 'method) ":"
                           (file-remote-p file 'user) "@" (file-remote-p file 'host)
                           "|sudo:root@"
                           (file-remote-p file 'host) ":" (file-remote-p file 'localname))
                 (concat "/sudo:root@localhost:" file))))
#+end_src

* Update Org Files on Portable App Startup

When running Emacs as a portable app, I want to pull down the latest versions of my ~org-agenda-files~ and other Org Mode files onto my USB flash drive (which has been set as the home directory). I also want to make sure to update the remote location when Emacs is killed so that all of my changes will be synced with the cloud and available for use on other systems.

#+begin_src emacs-lisp :tangle yes :noweb yes
  ;; Sync Dropbox containing org agenda files on load and close

  (when (freemacs/isportable-p)
    (setq rclone-path "~/rclone/rclone.conf")
    (rclone-run-remote-to-local "sync" "~/Dropbox" "dropbox:")
    (add-hook 'kill-emacs-hook (rclone-run-local-to-remote "sync"
                                                           "~/Dropbox"
                                                           "dropbox:")))
#+end_src

* Performance Optimization End

Close off the ~let~ statement at the beginning of the init file.

#+begin_src emacs-lisp :tangle yes
  (setq gc-cons-threshold 800000)
  )
#+end_src

* End

Add a final comment to indicate the end of the file.

#+begin_src emacs-lisp :tangle yes
  (provide 'init)

  ;;; init.el ends here
#+end_src

