docs/init.html

<div id="outline-container-org1e5ae62" class="outline-3">
<h3 id="org1e5ae62">PDF</h3>
<div class="outline-text-3" id="text-org1e5ae62">
<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the pdf module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-pdf</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org22d3fd7" class="outline-2">
<h2 id="org22d3fd7">Help</h2>
<div class="outline-text-2" id="text-org22d3fd7">
<p>
The <a href="modules/help/freemacs-help.html">help module</a> contains configuration that adds additional tools for help tools in Emacs:
</p>

<dl class="org-dl">
<dt>Helpful</dt><dd>Adds extra information to Emacs help buffers</dd>
<dt>Which-key</dt><dd>Shows a list of key bindings in Emacs for the current major mode</dd>
</dl>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load the help module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-help</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org703ab14" class="outline-2">
<h2 id="org703ab14">Emacs Server</h2>
<div class="outline-text-2" id="text-org703ab14">
<p>
Emacs can be run in a server mode where all other instances of Emacs can connect to it and have access to the same buffers. This also greatly increases the load time of new Emacs instances as Emacs does not have to go through the initialization process again. The configuration of the Emacs server can be found in the <a href="modules/server/freemacs-server.html">server module</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Load server module</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">require</span> '<span style="color: #df85ff; font-weight: bold;">freemacs-server</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org343d0f0" class="outline-2">
<h2 id="org343d0f0">Custom Functions</h2>
<div class="outline-text-2" id="text-org343d0f0">
<p>
This section contains custom functions that I have either created myself or borrowed from others to accomplish small tasks.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Custom Function Definitions</span>
</pre>
</div>
</div>

<div id="outline-container-org67ae1a8" class="outline-3">
<h3 id="org67ae1a8">Sudo Find File</h3>
<div class="outline-text-3" id="text-org67ae1a8">
<p>
This function creates a <code>sudo-find-file</code> command that can be used to open files as the super user. This can be really useful when combined with Embark. This function was copied from <a href="https://karthinks.com/software/fifteen-ways-to-use-embark/">https://karthinks.com/software/fifteen-ways-to-use-embark/</a>.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span>whicher <span style="color: #7984D1;">"sudo"</span><span style="color: #1ea8fc;">)</span>
<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">defun</span> <span style="color: #42c6ff;">sudo-find-file</span> <span style="color: #ff2afc;">(</span>file<span style="color: #ff2afc;">)</span>
  <span style="color: #A875FF;">"Open FILE as root."</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">interactive</span> <span style="color: #7984D1;">"FOpen file as root: "</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #a7da1e;">(</span>file-writable-p file<span style="color: #a7da1e;">)</span>
    <span style="color: #a7da1e;">(</span><span style="color: #ffd400;">user-error</span> <span style="color: #7984D1;">"File is user writeable, aborting sudo"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>find-file <span style="color: #a7da1e;">(</span><span style="color: #ff2afc; font-weight: bold;">if</span> <span style="color: #df85ff;">(</span>file-remote-p file<span style="color: #df85ff;">)</span>
                 <span style="color: #df85ff;">(</span>concat <span style="color: #7984D1;">"/"</span> <span style="color: #A875FF;">(</span>file-remote-p file 'method<span style="color: #A875FF;">)</span> <span style="color: #7984D1;">":"</span>
                         <span style="color: #A875FF;">(</span>file-remote-p file 'user<span style="color: #A875FF;">)</span> <span style="color: #7984D1;">"@"</span> <span style="color: #A875FF;">(</span>file-remote-p file 'host<span style="color: #A875FF;">)</span>
                         <span style="color: #7984D1;">"|sudo:root@"</span>
                         <span style="color: #A875FF;">(</span>file-remote-p file 'host<span style="color: #A875FF;">)</span> <span style="color: #7984D1;">":"</span> <span style="color: #A875FF;">(</span>file-remote-p file 'localname<span style="color: #A875FF;">)</span><span style="color: #df85ff;">)</span>
               <span style="color: #df85ff;">(</span>concat <span style="color: #7984D1;">"/sudo:root@localhost:"</span> file<span style="color: #df85ff;">)</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org836913e" class="outline-2">
<h2 id="org836913e">Update Org Files on Portable App Startup</h2>
<div class="outline-text-2" id="text-org836913e">
<p>
When running Emacs as a portable app, I want to pull down the latest versions of my <code>org-agenda-files</code> and other Org Mode files onto my USB flash drive (which has been set as the home directory). I also want to make sure to update the remote location when Emacs is killed so that all of my changes will be synced with the cloud and available for use on other systems.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #546A90;">;; </span><span style="color: #546A90;">Sync Dropbox containing org agenda files on load and close</span>

<span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">when</span> <span style="color: #ff2afc;">(</span>freemacs/isportable-p<span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> rclone-path <span style="color: #7984D1;">"~/rclone/rclone.conf"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>rclone-run-remote-to-local <span style="color: #7984D1;">"sync"</span> <span style="color: #7984D1;">"~/Dropbox"</span> <span style="color: #7984D1;">"dropbox:"</span><span style="color: #ff2afc;">)</span>
  <span style="color: #ff2afc;">(</span>add-hook 'kill-emacs-hook <span style="color: #a7da1e;">(</span>rclone-run-local-to-remote <span style="color: #7984D1;">"sync"</span>
                                                         <span style="color: #7984D1;">"~/Dropbox"</span>
                                                         <span style="color: #7984D1;">"dropbox:"</span><span style="color: #a7da1e;">)</span><span style="color: #ff2afc;">)</span><span style="color: #1ea8fc;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org78610db" class="outline-2">
<h2 id="org78610db">Performance Optimization End</h2>
<div class="outline-text-2" id="text-org78610db">
<p>
Close off the <code>let</code> statement at the beginning of the init file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">setq</span> gc-cons-threshold 800000<span style="color: #1ea8fc;">)</span>
<span style="color: #e61f44; font-weight: bold;">)</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd68a048" class="outline-2">
<h2 id="orgd68a048">End</h2>
<div class="outline-text-2" id="text-orgd68a048">
<p>
Add a final comment to indicate the end of the file.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp"><span style="color: #1ea8fc;">(</span><span style="color: #ff2afc; font-weight: bold;">provide</span> '<span style="color: #df85ff; font-weight: bold;">init</span><span style="color: #1ea8fc;">)</span>

<span style="color: #546A90;">;;; </span><span style="color: #546A90;">init.el ends here</span>
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Date: Time-stamp: <span class="timestamp-wrapper"><span class="timestamp">&lt;2022-07-07 Thu 17:01&gt;</span></span></p>
<p class="author">Author: Thomas Freeman</p>
<p class="date">Created: 2022-07-07 Thu 17:13</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
